// 12 34 56 78 910 1112 1314 1516 -> 1
// 24 57 911 1316 -> 2
// 47 913 -> 3

// 1,4
// 1r, 2r,  3r
// 2 -> 1 -> 1
// 4 -> 2 -> 1

// 1,15
// 12 34 56 78 910 1112 1314 1516 -> 1
// 13  57. 911 1315 -> 2
// 15. 915 -> 3
// 115 -> 4

// 1r  2r  3r,  4r
// 1   1   1    1
// 8   4   2    1

// 1. 위의 경우에 따르면 a,b를 2로 나눠 올림하여 반복해주고, count한다.
// 2. a,b가 같아지는 경우 count값을 출력한다.

function solution(n, a, b) {
  let cnt = 0;
  while (true) {
    cnt++;
    a = Math.ceil(a / 2);
    b = Math.ceil(b / 2);

    if (a === b) return cnt;
  }
}
